#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tls_private_key.private_key: Refreshing state... [id=cdc8e027025b72b2e19940e920c59fb4a9d3dbb6]
null_resource.download_package: Refreshing state... [id=3891381789011349217]
module.rds.random_password.master_password[0]: Refreshing state... [id=none]
random_pet.this: Refreshing state... [id=ample-dassie]
module.rds.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=D6u42Q]
module.mq_broker.random_password.mq_application_password[0]: Refreshing state... [id=none]
module.mq_broker.random_password.mq_admin_password[0]: Refreshing state... [id=none]
module.mq_broker.random_string.mq_admin_user[0]: Refreshing state... [id=mYAaqgtk]
module.mq_broker.random_string.mq_application_user[0]: Refreshing state... [id=kmIcntYy]
tls_self_signed_cert.example: Refreshing state... [id=198906409942098687288064107967959489506]
random_password.redshift_password: Refreshing state... [id=none]
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=485ab5a06b4c2883f3e558b6aaf07077ec1500f8]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=6858741167819826858]
module.lambda_layer_local.local_file.archive_plan[0]: Refreshing state... [id=6af6425157d7803b3a290b6cf63c40167d8a59a4]
module.lambda_layer_local.null_resource.archive[0]: Refreshing state... [id=1642729238923781647]
module.sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/707066037989/user]
module.mq_broker.aws_ssm_parameter.mq_master_password[0]: Refreshing state... [id=/mq/mq_admin_password]
module.apigatewayv2_lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/apigatewayv2-lambda]
module.mq_broker.aws_ssm_parameter.mq_application_username[0]: Refreshing state... [id=/mq/mq_application_username]
module.mq_broker.aws_ssm_parameter.mq_master_username[0]: Refreshing state... [id=/mq/mq_admin_username]
module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:eu-central-1:707066037989:certificate/1d5782d6-a732-4f38-9a11-c5c6ff46733c]
aws_ssm_document.ssm_document: Refreshing state... [id=docs]
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/cq-provider-aws-lambda]
module.redshift.aws_redshift_parameter_group.this[0]: Refreshing state... [id=cq-provider-aws-redshift-1-0-custom-params]
aws_cognito_user_pool.this: Refreshing state... [id=eu-central-1_ltyvi7Veo]
aws_kms_key.ec2_kms_key: Refreshing state... [id=0208bcfd-c4ec-4228-a520-96c6ee602e33]
aws_iot_thing_type.integration_test_thing_types: Refreshing state... [id=integration-test-thing-type]
aws_cloudwatch_log_group.logs: Refreshing state... [id=apigatewayv2-cloudwatch-log-group]
aws_kms_key.sns_kms_key: Refreshing state... [id=c4ad4fb9-f56e-4e02-bc84-3681d59b582c]
aws_sagemaker_notebook_instance.sagemaker_notebook: Refreshing state... [id=cq-provider-aws-sagemaker-notebook]
aws_sqs_queue.dlq: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/707066037989/ample-dassie]
aws_iot_policy.iot_policy: Refreshing state... [id=integration_test_policy]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b68c76c27957b80d]
module.cq_provider_aws_s3.aws_s3_bucket.this[0]: Refreshing state... [id=cq-provider-aws-bucket]
aws_s3_bucket.truststore: Refreshing state... [id=cq-provider-aws-truststore]
aws_accessanalyzer_analyzer.cq-provider-aws-test: Refreshing state... [id=cq-provider-aws-test]
aws_iam_role.integration_test_iot_role: Refreshing state... [id=integration_test_iot_role]
module.mq_broker.aws_ssm_parameter.mq_application_password[0]: Refreshing state... [id=/mq/mq_application_password]
module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:eu-central-1:707066037989:cluster/cq-provider-aws-ecs]
aws_iot_thing_group.iot_thing_group_parent: Refreshing state... [id=iot_group_parent]
aws_iot_certificate.iot_certificate: Refreshing state... [id=7bbead7723bdacfcb42cc342ad4bab31bb6aa8949c48715f1c3c8bab074c64ee]
aws_sns_topic.iot_test_topic: Refreshing state... [id=arn:aws:sns:eu-central-1:707066037989:iot_test_topic]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=cq-provider-aws-lambda]
module.lambda_layer_local.aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:eu-central-1:707066037989:layer:cq-provider-aws-layer-local:2]
module.apigatewayv2_lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=apigatewayv2-lambda]
aws_iot_thing.integration_test_thing: Refreshing state... [id=integration_test_thing]
module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z0658522FVQFS68ICLA1__88c5460283924036ad3273a4e30152c6.apigatewayv2.cloudquery-test.com._CNAME]
module.acm.aws_route53_record.validation[1]: Refreshing state... [id=Z0658522FVQFS68ICLA1__818a6393a27888cc75491ba41ae2609c.cloudquery-test.com._CNAME]
module.sns.aws_sns_topic.this[0]: Refreshing state... [id=arn:aws:sns:eu-central-1:707066037989:users-encrypted-20211228144345396900000002]
aws_iot_policy_attachment.integration_test_iot_policy_attachment: Refreshing state... [id=integration_test_policy|arn:aws:iot:eu-central-1:707066037989:cert/7bbead7723bdacfcb42cc342ad4bab31bb6aa8949c48715f1c3c8bab074c64ee]
aws_iot_thing_group.iot_thing_group_group: Refreshing state... [id=iot_group_child]
module.step_function.aws_iam_role.this[0]: Refreshing state... [id=apigatewayv2-step_function]
module.lambda_function.aws_iam_policy.dead_letter[0]: Refreshing state... [id=arn:aws:iam::707066037989:policy/tf-managed/cq-provider-aws-lambda-dl]
module.apigatewayv2_lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::707066037989:policy/apigatewayv2-lambda-logs]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::707066037989:policy/tf-managed/cq-provider-aws-lambda-logs]
module.apigatewayv2_lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=apigatewayv2-lambda]
aws_iam_role_policy.integration_test_tot_poicy: Refreshing state... [id=integration_test_iot_role:integration_test_tot_poicy]
aws_iot_topic_rule.integration_test_iot_topic_rule: Refreshing state... [id=integration_test_iot_topic_rule]
module.lambda_function.aws_iam_role_policy_attachment.dead_letter[0]: Refreshing state... [id=cq-provider-aws-lambda-20211228170110693000000002]
module.apigatewayv2_lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=apigatewayv2-lambda-20211228212632179700000002]
module.acm.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2021-12-28 21:26:52.692 +0000 UTC]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=cq-provider-aws-lambda-20211228170109909200000001]
aws_iot_thing_group_membership.example: Refreshing state... [id=iot_group_child/integration_test_thing]
module.step_function.aws_sfn_state_machine.this[0]: Refreshing state... [id=arn:aws:states:eu-central-1:707066037989:stateMachine:apigatewayv2-step_function]
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=t9w65y15hb]
module.mq_broker.module.security_group.aws_security_group.default[0]: Refreshing state... [id=sg-0ce2d6a42220575e5]
module.deny_all_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0b1b2d9927d89d1ba]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0984dedffd6ae238d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02f916ff12f622012]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-052559dd58811fd28]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0b1c111b7823cf5fc]
module.rds_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-00862c4a8499a26df]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
aws_apigatewayv2_authorizer.some_authorizer: Refreshing state... [id=1hh5yd]
module.apigatewayv2_lambda_function.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"]: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.apigatewayv2_lambda_function.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.mq_broker.module.security_group.aws_security_group_rule.default["egress--1-0-65535-9c87e5e1ed040a443ce1ac8e6d6cf159"]: Refreshing state... [id=sgrule-2345759085]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03dbd64e11d7a6d7b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0be006316ec2c122f]
module.mq_broker.aws_mq_broker.default[0]: Refreshing state... [id=b-ff46fcf1-e2c3-4e75-9261-ec59e668ecda]
module.redshift.aws_redshift_subnet_group.this[0]: Refreshing state... [id=cq-provider-aws]
module.ec2_instance.aws_instance.this[0]: Refreshing state... [id=i-00c19b89c88f74e55]
module.rds.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=cq-provider-aws-test-20211228140854379400000001]
module.api_gateway.aws_apigatewayv2_integration.this["ANY /"]: Refreshing state... [id=mxsr2kt]
module.api_gateway.aws_apigatewayv2_integration.this["POST /start-step-function"]: Refreshing state... [id=um9stmr]
module.api_gateway.aws_apigatewayv2_integration.this["$default"]: Refreshing state... [id=v08pnfa]
module.api_gateway.aws_apigatewayv2_integration.this["GET /some-route"]: Refreshing state... [id=wtqf960]
module.redshift.aws_redshift_cluster.this: Refreshing state... [id=cq-provider-aws]
module.api_gateway.aws_apigatewayv2_route.this["$default"]: Refreshing state... [id=g3ogqn5]
module.api_gateway.aws_apigatewayv2_route.this["ANY /"]: Refreshing state... [id=6lwcm8c]
module.api_gateway.aws_apigatewayv2_route.this["POST /start-step-function"]: Refreshing state... [id=nu3o5ap]
module.api_gateway.aws_apigatewayv2_route.this["GET /some-route"]: Refreshing state... [id=oial653]
module.rds.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=cq-provider-aws-test]
module.cq_provider_aws_s3.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=cq-provider-aws-bucket]
module.lambda_function.aws_s3_bucket_object.lambda_package[0]: Refreshing state... [id=lambda-builds/40d7e5d9a967c2d1ae6736211105006e3a0f16c872551be639acdaf1a7c334c4.zip]
aws_s3_bucket_object.truststore: Refreshing state... [id=truststore.pem]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=cq-provider-aws-lambda]
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=cloudquery-test.com]
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=g9rcsv]
aws_route53_record.api: Refreshing state... [id=Z0658522FVQFS68ICLA1_apigatewayv2-route53-record_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.api_gateway.aws_apigatewayv2_stage.default[0] has changed
  ~ resource "aws_apigatewayv2_stage" "default" {
      ~ deployment_id   = "cb5zz2" -> "ghrpif"
        id              = "$default"
        name            = "$default"
        tags            = {
            "Name" = "dev-api-new"
        }
        # (7 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.mq_broker.module.security_group.aws_security_group.default[0] has changed
  ~ resource "aws_security_group" "default" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0ce2d6a42220575e5"
        name                   = "eg-test-mq-broker"
        tags                   = {
            "Name"      = "eg-test-mq-broker"
            "Namespace" = "eg"
            "Stage"     = "test"
        }
        # (7 unchanged attributes hidden)
    }

  # module.mq_broker.module.security_group.aws_security_group_rule.default["egress--1-0-65535-9c87e5e1ed040a443ce1ac8e6d6cf159"] has changed
  ~ resource "aws_security_group_rule" "default" {
        id                = "sgrule-2345759085"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
      ~ to_port           = 65535 -> 0
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket_object.truststore will be updated in-place
  ~ resource "aws_s3_bucket_object" "truststore" {
      ~ content                = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDSDCCAjCgAwIBAgIRAJWj+ymedNN8xeZIEcNfW+IwDQYJKoZIhvcNAQELBQAw
            MzEbMBkGA1UEChMSQUNNRSBFeGFtcGxlcywgSW5jMRQwEgYDVQQDEwtleGFtcGxl
            LmNvbTAeFw0yMjAzMDEwODExMDdaFw0yMjAzMDEyMDExMDdaMDMxGzAZBgNVBAoT
            EkFDTUUgRXhhbXBsZXMsIEluYzEUMBIGA1UEAxMLZXhhbXBsZS5jb20wggEiMA0G
            CSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCtc0xY2Tp6YWLp20PjLV4Ka9+MNBv7
            vzQVZGGlCXh3qx+Uhe/isI/CPHzEtzsqVXWsPzFnxc6Jt1pGxLsV5ZKZU/gM9rzw
            oiojkI092AcBt1RAQ7XcntDEs4BxYyKpqRIO2DVp76UZP/KcBDSFVoI7z/B20DW9
            uRrGDGVdmjG7XMIDKHxDfb3iDwO0jLrTNPWz3a7oAfsmnIQlMFZI34gNurLKNxyh
            Psh4qJ2CkXfDb1I/TPHOoOEpJZBtuusAxO4714LxxXuxukz6PU4qH6uSg65zltbL
            LxnaYebFMn0PAnCkWemwbjkZEZG5H4xdOQlbW3lBwfzLon44Z1xjycL3AgMBAAGj
            VzBVMA4GA1UdDwEB/wQEAwICBDATBgNVHSUEDDAKBggrBgEFBQcDATAPBgNVHRMB
            Af8EBTADAQH/MB0GA1UdDgQWBBSRX13UgCFDZw4efKa8IcfGi6c/iTANBgkqhkiG
            9w0BAQsFAAOCAQEAkmdaSQn44ZYc3mrocBp8wF3kkn7dieBtLNKpy4vyHZLl4NIg
            k2r4lU6XXOeT3Hur+B3LnftKTQ77M98FQ1YKxlRfjNPfveE9MX8uz2MZmS4Lwanr
            9R8iul3K/C+fptc10YVaJtnrhQpnvMg6rqSGFt/BeKj7FeUftNdf9XCdrPLEA7jm
            y80Be0e+I2JbwXCvHS7Da2qc5QNdS1OfPvIje9vLKHCRggChZxEx5KuHAm+6RSUi
            VD5coyuIn3bh19m7G9dq8wBF237hGaIF6bSv2VtxZv4cl/j7y56lb59l8dF3oVke
            jLt3Be8mKqPARUDzX4OyfwFNSz1jzhbqz66tKQ==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
        id                     = "truststore.pem"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # tls_self_signed_cert.example must be replaced
-/+ resource "tls_self_signed_cert" "example" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDSDCCAjCgAwIBAgIRAJWj+ymedNN8xeZIEcNfW+IwDQYJKoZIhvcNAQELBQAw
            MzEbMBkGA1UEChMSQUNNRSBFeGFtcGxlcywgSW5jMRQwEgYDVQQDEwtleGFtcGxl
            LmNvbTAeFw0yMjAzMDEwODExMDdaFw0yMjAzMDEyMDExMDdaMDMxGzAZBgNVBAoT
            EkFDTUUgRXhhbXBsZXMsIEluYzEUMBIGA1UEAxMLZXhhbXBsZS5jb20wggEiMA0G
            CSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCtc0xY2Tp6YWLp20PjLV4Ka9+MNBv7
            vzQVZGGlCXh3qx+Uhe/isI/CPHzEtzsqVXWsPzFnxc6Jt1pGxLsV5ZKZU/gM9rzw
            oiojkI092AcBt1RAQ7XcntDEs4BxYyKpqRIO2DVp76UZP/KcBDSFVoI7z/B20DW9
            uRrGDGVdmjG7XMIDKHxDfb3iDwO0jLrTNPWz3a7oAfsmnIQlMFZI34gNurLKNxyh
            Psh4qJ2CkXfDb1I/TPHOoOEpJZBtuusAxO4714LxxXuxukz6PU4qH6uSg65zltbL
            LxnaYebFMn0PAnCkWemwbjkZEZG5H4xdOQlbW3lBwfzLon44Z1xjycL3AgMBAAGj
            VzBVMA4GA1UdDwEB/wQEAwICBDATBgNVHSUEDDAKBggrBgEFBQcDATAPBgNVHRMB
            Af8EBTADAQH/MB0GA1UdDgQWBBSRX13UgCFDZw4efKa8IcfGi6c/iTANBgkqhkiG
            9w0BAQsFAAOCAQEAkmdaSQn44ZYc3mrocBp8wF3kkn7dieBtLNKpy4vyHZLl4NIg
            k2r4lU6XXOeT3Hur+B3LnftKTQ77M98FQ1YKxlRfjNPfveE9MX8uz2MZmS4Lwanr
            9R8iul3K/C+fptc10YVaJtnrhQpnvMg6rqSGFt/BeKj7FeUftNdf9XCdrPLEA7jm
            y80Be0e+I2JbwXCvHS7Da2qc5QNdS1OfPvIje9vLKHCRggChZxEx5KuHAm+6RSUi
            VD5coyuIn3bh19m7G9dq8wBF237hGaIF6bSv2VtxZv4cl/j7y56lb59l8dF3oVke
            jLt3Be8mKqPARUDzX4OyfwFNSz1jzhbqz66tKQ==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id                    = "198906409942098687288064107967959489506" -> (known after apply)
      ~ ready_for_renewal     = false -> true # forces replacement
      ~ validity_end_time     = "2022-03-01T22:11:07.597783+02:00" -> (known after apply)
      ~ validity_start_time   = "2022-03-01T10:11:07.597783+02:00" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ subject {
          - street_address = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.api_gateway.aws_apigatewayv2_domain_name.this[0] will be updated in-place
  ~ resource "aws_apigatewayv2_domain_name" "this" {
        id                               = "cloudquery-test.com"
        tags                             = {
            "Name" = "dev-api-new"
        }
        # (4 unchanged attributes hidden)


      ~ mutual_tls_authentication {
          + truststore_version = (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["$default"] will be updated in-place
  ~ resource "aws_apigatewayv2_integration" "this" {
        id                     = "v08pnfa"
        # (9 unchanged attributes hidden)


      + tls_config {
          + server_name_to_verify = "cloudquery-test.com"
        }
        # (2 unchanged blocks hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6858741167819826858" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1646122253204968000" -> "1646308302353600000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_local.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1642729238923781647" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1641812544558579995" -> "1646308273461488170"
            # (1 unchanged element hidden)
        }
    }

Plan: 3 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @yevgenypats, Action: `pull_request`, Working Directory: ``, Workflow: `terraform_plan`*